{
    "non_connecte_H2": "You are not logged in",
    "non_connecte_message": "You must be logged in to access this page.",

    "main_H4": "CREATE YOUR SITE LIKE A PRO",
    "main_H1_part1": "Hi, I am",
    "main_Span": "Vazgen",
    "main_H1_part2": ", WEB Developer",
    "main_P1": "Passionate about creating exceptional online experiences. My goal is to bring your digital ideas to life, from conception to completion, using modern technologies and cutting-edge development practices." ,
    "main_P2": "With strong expertise in HTML, CSS, JavaScript and a passion for user-friendly design, I strive to create websites that not only visually impress, but work smoothly and intuitively to deliver an exceptional user experience.",
    "main_P3": "Whether you need an online presence for your business, an attractive online store, or a custom web application, I'm here to turn your vision into digital reality. Explore my portfolio to check out some of my recent projects and feel free to contact me to discuss how I can help you achieve your online goals.",
    "main_P4": "Explore the site to learn more about my background and skills, and don't hesitate to contact me if you have any questions or would like to collaborate on an exciting project. Together, we can create something something exceptional. Welcome to my portfolio!",
    "main_H2": "My Fundamentals",
    "main_H4_part1": "Commitment",
    "main_P_part1": "My total dedication to each project is the cornerstone of my approach.",
    "main_H4_part2": "Creativity",
    "main_P_part2": "Innovation is my source of inspiration, and my creativity sets me apart.",
    "main_H4_part3": "Technical Expertise",
    "main_P_part3": "My mastery of web technologies serves performance and reliability.",
    "main_H4_part4": "Collaboration",
    "main_P_part4": "I value close collaboration with my clients for exceptional results.",
    "main_H4_part5": "Quality",
    "main_P_part5": "My commitment to excellence is visible in every aspect of my work.",
    "main_H4_part6": "Responsiveness",
    "main_P_part6": "My permanent availability guarantees a rapid response to your needs",

    "main_Aide_Titre": "Home",
    "main_Aide_P1": "The Home Page is the starting point of your experience on our website.",
    "main_Aide_P2": "It provides an overview of the features and information available here.",
    "main_Aide_P3": "Here's what you can do here:",
    "main_Aide_P4": "Home: Return to this page at any time by clicking Home.",
    "main_Aide_P5": "Documentation: Consult our documentation for detailed information about our service.",
    "main_Aide_P6": "Contact: For any questions or assistance, click Contact to leave us a message.",
    "main_Aide_P7": "Create Meeting: If you want to organize a meeting, use Create Meeting to get started.",
    "main_Aide_P8": "Consult Meeting: If you want to view/join a meeting, use Consult Meeting to get started.",
    "main_Aide_P9": "Meetings: If you want to view the created meetings, use Meetings.",
    "main_Aide_P10": "Login: If you are already a member, log in by clicking Login. Otherwise, create an account.",
    "main_Aide_P11": "We hope that your visit to our Home Page is pleasant and that you find the information you need.",
    "main_Aide_P12": "Feel free to explore and use the features offered to get the most out of our website.",

    "footer_H5": "© 2023 | Vazgen Markaryan.",
    "footer_Button1": "French (FR)",
    "footer_Button2": "English (EN)",
    "footer_Button3": "Russian (RU)",

    "navbar_Accueil": "Home",
    "navbar_Documentation": "Documentation",
    "navbar_Contacter": "Contact",
    "navbar_Creer_Reunion": "Create Meeting",
    "navbar_Consulter_Reunion": "Consult Meeting",
    "navbar_Reunions": "Meetings",
    "navbar_Connexion": "Login",
    "navbar_Aide": "Help",
    "deconnexion": "Logout",

    "connexion_H2": "Identification",
    "connexion_Pseudonime": "Pseudonym",
    "connexion_MDP": "Password",
    "connexion_MDP_Oublie": "Forgot your password?",
    "connexion_Inscrivez_Vous": "Not registered yet?",
    "connexion_Se_Connecter": "Login",
    "connexion_Pseudonime_Error": "Must contain letters, digits, and uppercase letters.",
    "connexion_Password_Error": "Must be at least 8 characters long, contain an uppercase letter, and a digit.",
    "connexion_Authentification_Erreur": "Authentication error",
    "connexion_Connexion_Erreur": "Incorrect username or password or user does not exist.",

    "inscription_H2": "Registration",
    "inscription_Pseudonime": "Pseudonym",
    "inscription_MDP": "Password",
    "inscription_MDP_Confirmation": "Password confirmation",
    "inscription_Inscrire": "Register",
    "inscription_Deja_Inscrit": "Already registered?",
    "inscription_Pseudonime_Error": "Must contain letters, digits, and uppercase letters.",
    "inscription_Password_Error": "Must be at least 8 characters long, contain an uppercase letter, and a digit.",
    "inscription_Confirmation_Error": "Passwords do not match.",
    "utilisateur_existant": "This username already exists. Please choose another one.",

    "MDP_Oublie_H2": "Forgot your password",
    "MDP_Oublie_Pseudonime": "Pseudonym",
    "MDP_Oublie_Courriel": "Email",
    "MDP_Oublie_Retour_Connexion": "Connect",
    "MDP_Oublie_Pseudonime_Error": "Must contain letters, numbers and capital letters.",
    "MDP_Oublie_Courriel_Invalide_Error": "Must contain letters, numbers and capital letters. exemple123@domain.domain",
    "MDP_Oublie_Envoyer_Demande-Reinitialisation": "Send a reset request",
    "MDP_Oublie_Logique": "The password reset logic has not yet been implemented.",

    "nonTrouve_Titre" : "404",
    "nonTrouve_Aide_P1" : "If you thought you would find riddle answers here, I've got news for you. IT'S EMPTY. HA-HA-HA!",
    "nonTrouve_H1": "Page not found",
    "nonTrouve_P1": "You have reached a non-existent page.",
    "nonTrouve_P2": "Answer the riddle to access the Home page:",
    "nonTrouve_Input": "Your answer here",
    "nonTrouve_Bouton": "Submit",
    "nonTrouve_Mauvaise_Reponse": "Wrong answer. Try again.",

    "devinette_1": "What JavaScript framework is used in this application?",
    "devinette_2": "What is the primary programming language of Angular?",
    "devinette_3": "Who is the best WEB programming teacher?",

    "documentation_Aide_Titre": "Documentation",
    "documentation_Aide_P1": "Welcome to the comprehensive documentation. If you need help understanding our skills and expertise, you're in the right place. Explore our technical knowledge below to get a better grasp of what we can offer you.",
    "documentation_Aide_P2": "HTML: Learn how we use HTML to create the structure of websites, ensuring smooth navigation and logical presentation.",
    "documentation_Aide_P3": "CSS: Find out how CSS adds style to your website by defining colors, fonts, and other properties for an attractive visual experience.",
    "documentation_Aide_P4": "JavaScript: Explore how JavaScript is used to make your website interactive with dynamic features.",
    "documentation_Aide_P5": "Angular: Discover how we use Angular, a JavaScript framework, to create complex and responsive web applications.",
    "documentation_Aide_P6": "Bootstrap: Learn how we use Bootstrap, a CSS framework, to design responsive and aesthetic websites more quickly and efficiently.",
    "documentation_Aide_P7": "Java: Learn how we use Java to code the backend of your application, handling essential operations behind the scenes.",
    "documentation_Aide_P8": "Spring Framework: Explore how the Spring Framework simplifies enterprise application development, including security and transaction management.",
    "documentation_Aide_P9": "SQL Database: Discover how we use SQL to efficiently store and manage your application's data.",

    "HTML": "Hypertext Markup Language",
    "HTML_Description": "This is the foundational pillar of web creation. This structured markup language allows us to define the composition of a web page by organizing its content into headings, paragraphs, images, links, and other elements.",
    "HTML_Usage": "By using HTML, we build your site's structure in a logical and well-formatted manner, ensuring a smooth and enjoyable browsing experience.",

    "CSS": "Cascade Style Sheet",
    "CSS_Description": "This is the styling tool that gives a visual look to your website.",
    "CSS_Usage": "By combining HTML with CSS, I define colors, fonts, margins, spacing, and other style properties to make your website attractive and professional.",

    "JavaScript": "JavaScript",
    "JavaScript_Description": "This is an essential programming language for web interactivity.",
    "JavaScript_Usage": "I use it to add dynamic features, enhancing visitor engagement and providing an interactive user experience.",

    "Angular": "Angular",
    "Angular_Description": "This is a JavaScript framework developed by Google, designed for creating complex web applications.",
    "Angular_Usage": "I use Angular to build modular and well-structured applications, ensuring a smooth and responsive user experience.",

    "Bootstrap": "Bootstrap",
    "Bootstrap_Description": "This is an open-source CSS framework that greatly facilitates the design of responsive and aesthetic websites.",
    "Bootstrap_Usage": "I use Bootstrap to accelerate the creation of attractive layouts and user interfaces using a collection of pre-designed components.",

    "Java": "Java",
    "Java_Description": "This is a versatile programming language used in various fields, including desktop application development, Android mobile applications, and enterprise applications.",
    "Java_Usage": "In Java, I code the backend of your application, handling data, authentication, and other essential features.",

    "Spring": "Spring Framework",
    "Spring_Description": "This is a renowned Java framework for enterprise application development, offering a ready-made architecture to simplify the development of robust applications.",
    "Spring_Usage": "Thanks to Spring, I accelerate the creation of your enterprise applications while ensuring their quality and easy maintenance.",

    "SQL": "Structured Query Language",
    "SQL_Description": "This is a relational database management system, structurally storing information in interconnected tables.",
    "SQL_Usage": "Using SQL, I establish a database that efficiently stores and manages your application's data.",

    "contacter_H2": "Contact Us",
    "contacter_Nom": "Last Name",
    "contacter_Prenom": "First Name",
    "contacter_Courriel": "Email",
    "contacter_Message": "Message",
    "contacter_Envoyer": "Send",
    "contacter_Envoyee": "Message sent successfully!",
    "contacter_Messages_Envoyes": "Show sent messages",

    "contacter_Aide_Titre": "Contact Us",
    "contacter_Aide_P1" : "To contact us, please fill out the form below.",
    "contacter_Aide_P2" : "We are here to help you with any questions and concerns you may have.",
    "contacter_Aide_P3" : "Please make sure to fill in all the required fields so we can respond to you more quickly.",
    "contacter_Aide_P4" : "Please provide valid information so we can reach you if necessary.",
    "contacter_Aide_P5" : "Your message should not exceed 250 characters.",
    "contacter_Aide_P6" : "Click the 'Send' button when you have finished filling out the form.",
    "contacter_Aide_P7" : "The Show Sent Messages button can display your messages already sent to the website owner.",

    "contacter_Nom_Error_Message": "Must contain lowercase and uppercase letters.",
    "contacter_Prenom_Error_Message": "Must contain letters, numbers, and uppercase letters.",
    "contacter_Courriel_Error_Message": "Must contain letters, numbers, and uppercase letters. example123@email.domain.",
    "contacter_Limite_Error_Message": "Maximum of 250 characters reached.",

    "popup_H5": "Sent Messages",
    "popup_Prenom": "First Name",
    "popup_Nom": "Last Name",
    "popup_Email": "Email",
    "popup_Telephone": "Phone",
    "popup_Message": "Message",

    "creer_reunion_H2": "Create Meeting",
    "creer_reunion_Nom": "Last Name",
    "creer_reunion_Prenom": "First Name",
    "creer_reunion_Courriel": "Email",
    "creer_reunion_Description": "Description",
    "creer_reunion_ID_Reunion": "Meeting ID",
    "creer_reunion_Creer": "Create Meeting",
    "creer_reunion_Reunion_Cree": "Meeting created successfully!",
    "dateDebut": "Start Date",
    "dateFin": "End Date",

    "creer_reunion_Aide_Titre": "Create Meeting",
    "creer_reunion_Aide_P1": "Welcome to the creation Meeting page. This page allows you to create a new meeting by providing the required information. To help you fill out the form correctly, i've prepared detailed instructions below.",
    "creer_reunion_Aide_P2": "1. Last Name and First Name: Please enter your last name and first name in the appropriate fields. Ensure that this information is correct as it's important for identification.",
    "creer_reunion_Aide_P3": "2. Email: Enter your email address in this field. This will allow us to contact you and send important information about your meeting.",
    "creer_reunion_Aide_P4": "3. Meeting ID: You must provide a unique identifier for your meeting. Ensure it contains exactly 8 characters.",
    "creer_reunion_Aide_P5": "4. You must choose the start and end dates of your meeting.",
    "creer_reunion_Aide_P6": "5. Description: Add a description of your meeting. You have a limit of 250 characters to describe your meeting in a few words.",
    "creer_reunion_Aide_P7": "Once you have correctly filled out the form, the 'Create' button will become active, and you can create your meeting.",

    "creer_reunion_Nom_Error_Message": "Must contain lowercase and uppercase letters.",
    "creer_reunion_Prenom_Error_Message": "Must contain letters, numbers, and uppercase letters.",
    "creer_reunion_Courriel_Error_Message": "Must contain letters, numbers, and uppercase letters. example123@domain.domain",
    "creer_reunion_ID_Error_Message": "Must have a maximum of 8 characters, letters, and numbers.",
    "creer_reunion_Limite_Error_Message": "Maximum of 250 characters reached.",
    "creer_reunion_ID_Existe_Error_Message": "ID already exists.",

    "voir_reunion_H2": "Consult Meeting",
    "voir_reunion_Nom": "Last Name",
    "voir_reunion_Prenom": "First Name",
    "voir_reunion_ID_Reunion": "Meeting ID",
    "voir_reunion_Consulter": "Consult Meeting",
    "voir_reunion_Date_Debut": "Start Date",
    "voir_reunion_Date_Fin": "End Date",
    "voir_reunion_Courriel": "Email",
    "voir_reunion_Description": "Description",
    "voir_reunion_Participant": "Participant",
    "voir_reunion_Disponnible": "Availability",
    "voir_reunion_Back": "Back",
    "voir_reunion_Rejoindre": "Join",
    "voir_reunion_Ajouter" : "Add My Availability",
    "voir_reunion_Disponnible_placeholder" : "Availability from dd-mm-yyyy to dd-mm-yyyy",
    "voir_reunion_Deja_Participant" : "You are already a participant in the meeting",
    "participation_changement": "You are now participating in the meeting",

    "voir_reunion_Aide_Titre": "View Meeting",
    "voir_reunion_Aide_P1": "The meeting viewing page allows you to view a specific meeting. To do so, follow the steps below:",
    "voir_reunion_Aide_P2": "1. Fill in the required fields for the meeting search. You must provide your first and last name and the meeting ID.",
    "voir_reunion_Aide_P3": "2. Ensure that the information you enter is correct, as it is essential for the search.",
    "voir_reunion_Aide_P4": "3. Once you have filled in all the required fields, the 'View Meeting' button will become available.",
    "voir_reunion_Aide_P5": "4. Click on the 'View Meeting' button to initiate the search.",
    "voir_reunion_Aide_P6": "5. If the information is correct, and a match is found, the meeting details will be displayed on the screen.",
    "voir_reunion_Aide_P7": "6. If no meeting is found, or if the information is incorrect, you will get an empty Array. In this case go back and check Meeting ID.",

    "voir_reunion_Nom_Error_Message": "Must contain lowercase and uppercase letters.",
    "voir_reunion_Prenom_Error_Message": "Must contain letters, numbers, and uppercase letters.",
    "voir_reunion_ID_Error_Message": "Must be a maximum of 8 characters, letters, and numbers.",

    "reunions_Aide_Titre": "Meetings Table",
    "reunions_Aide_P1": "Welcome to the meetings page. This page allows you to manage created meetings. Here is some information on how it works:",
    "reunions_Aide_P2": "Meetings are displayed in a table. Each row represents a meeting with details such as name, first name, email, identifier, date, and description.",
    "reunions_Aide_P3": "To delete a meeting, click on the delete button (trash icon) corresponding to the meeting you want to delete. A confirmation will be asked before deletion.",
    "reunions_Aide_P4": "You will instantly see the changes if you click on the delete button and confirm your choice.",

    "confirmation_Dialog_Title": "Deletion Confirmation",
    "confirmation_Dialog_Message": "Are you sure you want to delete this meeting? Attention, this action is irreversible and permanent!",
    "confirmation_Dialog_Supprimer": "Delete",
    "confirmation_Dialog_Annuler": "Cancel",
    "confirmation_suppression": "Are you sure you want to delete this meeting? Please note that this action is irreversible and permanent!",

    "tableau_position": "No.",
    "tableau_courriel": "Email",
    "tableau_identificateur": "ID",
    "tableau_date": "Date",
    "tableau_description": "Description",
    "tableau_participants": "Participants (Availabilities)",
    "tableau_nom": "Creator's Last Name",
    "tableau_prenom": "Creator's First Name",
    "tableau_date1": "Start Date",
    "tableau_date2": "End Date",
    "tableau_action": "Action",

    "date_manager": "Manage Dates",
    "date_modifier": "Modify Date",
    "date_debut": "Start Date",
    "date_fin": "End Date"

}
