{
    "non_connecte_H2": "Vous n'êtes pas connecté",
    "non_connecte_message": "Vous devez être connecté pour accéder à cette page.",

    "main_H4": "CRÉEZ VOTRE SITE COMME UN PRO",
    "main_H1_part1": "Salut, je suis",
    "main_Span": "Vazgen",
    "main_H1_part2": ", Développeur WEB",
    "main_P1": "Passionné par la création d'expériences en ligne exceptionnelles. Mon objectif est de donner vie à vos idées numériques, de la conception à la réalisation, en utilisant des technologies modernes et des pratiques de développement de pointe.",
    "main_P2": "Avec une solide expertise en HTML, CSS, JavaScript et une passion pour la conception conviviale, je m'efforce de créer des sites web qui non seulement impressionnent visuellement, mais qui fonctionnent de manière fluide et intuitive pour offrir une expérience utilisateur exceptionnelle.",
    "main_P3": "Que vous ayez besoin d'une présence en ligne pour votre entreprise, d'une boutique en ligne attractive ou d'une application web personnalisée, je suis là pour transformer votre vision en réalité numérique. Explorez mon portfolio pour découvrir certains de mes projets récents et n'hésitez pas à me contacter pour discuter de la façon dont je peux vous aider à atteindre vos objectifs en ligne.",
    "main_P4": "Explorez le site afin de savoir plus sur mon parcours et mes compétences, et n'hésitez pas à me contacter si vous avez des questions ou si vous souhaitez collaborer sur un projet passionnant. Ensemble, nous pouvons créer quelque chose d'exceptionnel. Bienvenue sur mon portfolio!",
    "main_H2": "Mes Principes Fondamentaux",
    "main_H4_part1": "Engagement",
    "main_P_part1": "Mon dévouement total à chaque projet est la pierre angulaire de mon approche.",
    "main_H4_part2": "Créativité",
    "main_P_part2": "L'innovation est ma source d'inspiration, et ma créativité me distingue.",
    "main_H4_part3": "Expertise Technique",
    "main_P_part3": "Ma maîtrise des technologies web est au service de la performance et de la fiabilité.",
    "main_H4_part4": "Collaboration",
    "main_P_part4": "Je valorise la collaboration étroite avec mes clients pour des résultats exceptionnels.",
    "main_H4_part5": "Qualité",
    "main_P_part5": "Mon engagement envers l'excellence est visible dans chaque aspect de mon travail.",
    "main_H4_part6": "Réactivité",
    "main_P_part6": "Ma disponibilité permanente garantit une réponse rapide à vos besoins",

    "main_Aide_Titre": "Accueil",
    "main_Aide_P1": "La Page d'Accueil est le point de départ de votre expérience sur notre site web.",
    "main_Aide_P2": "Elle offre un aperçu des fonctionnalités et des informations disponibles ici.",
    "main_Aide_P3": "Voici ce que vous pouvez faire ici:",
    "main_Aide_P4": "Accueil : Retournez à cette page à tout moment en cliquant sur Accueil.",
    "main_Aide_P5": "Documentation : Consultez notre documentation pour obtenir des informations détaillées sur notre service.",
    "main_Aide_P6": "Contacter : Pour toute question ou assistance, cliquez sur Contactez-nous pour nous laisser un message.",
    "main_Aide_P7": "Créer Réunion: Si vous souhaitez organiser une réunion, utilisez Créer Réunion pour commencer.",
    "main_Aide_P8": "Consulter Réunion: Si vous souhaitez consulter/réjoindre une réunion, utilisez Consulter Réunion pour commencer.",
    "main_Aide_P9": "Réunions: Si vous souhaitez consulter les réunions créées, utilisez Réunions",
    "main_Aide_P10": "Connexion : Si vous êtes déjà membre, connectez-vous en cliquant sur Connexion. Sinon, créez-vous un compte.",
    "main_Aide_P11": "Nous espérons que votre visite sur notre Page d'Accueil soit agréable et que vous trouviez les informations dont vous avez besoin.",
    "main_Aide_P12": "N'hésitez pas à explorer et à utiliser les fonctionnalités offertes pour tirer le meilleur parti de notre site web.",

    "footer_H5": "© 2023 | Vazgen Markaryan.",
    "footer_Button1": "Français (FR)",
    "footer_Button2": "Anglais (EN)",
    "footer_Button3": "Russe (RU)",

    "navbar_Accueil": "Accueil",
    "navbar_Documentation": "Documentation",
    "navbar_Contacter": "Contacter",
    "navbar_Creer_Reunion": "Créer Réunion",
    "navbar_Consulter_Reunion": "Consulter Réunion",
    "navbar_Reunions": "Réunions",
    "navbar_Connexion": "Connexion",
    "navbar_Aide": "Aide",
    "deconnexion": "Déconnexion",

    "connexion_H2": "Identification",
    "connexion_Pseudonime": "Pseudonime",
    "connexion_MDP": "Mot de passe",
    "connexion_MDP_Oublie": "Mot de passe oublié?",
    "connexion_Inscrivez_Vous": "Inscrivez-vous",
    "connexion_Se_Connecter": "Se connecter",
    "connexion_Pseudonime_Error": "Doit contenir des lettres, des chiffres et des majuscules.",
    "connexion_Password_Error": "Doit comporter au moins 8 caractères, une majuscule et un chiffre.",
    "connexion_Authentification_Erreur": "Erreur d'authentification",
    "connexion_Connexion_Erreur": "Utilisateur ou mot de passe incorrect ou utilisateur inexistant.",

    "inscription_H2": "Inscription",
    "inscription_Pseudonime": "Pseudonime",
    "inscription_MDP": "Mot de passe",
    "inscription_MDP_Confirmation": "Confirmer mot de passe",
    "inscription_Inscrire": "S'inscrire",
    "inscription_Deja_Inscrit": "Déjà inscrit?",
    "inscription_Pseudonime_Error": "Doit contenir des lettres, des chiffres et des majuscules.",
    "inscription_Password_Error": "Doit comporter au moins 8 caractères, une majuscule et un chiffre.",
    "inscription_Confirmation_Error": "Les mots de passe ne correspondent pas.",
    "utilisateur_existant": "Ce pseudonyme existe déjà. Veuillez en choisir un autre.",

    "MDP_Oublie_H2": "Mot de passe oublié",
    "MDP_Oublie_Pseudonime": "Pseudonime",
    "MDP_Oublie_Courriel": "Courriel",
    "MDP_Oublie_Retour_Connexion": "Se connecter",
    "MDP_Oublie_Pseudonime_Error": "Doit contenir des lettres, des chiffres et des majuscules.",
    "MDP_Oublie_Courriel_Invalide_Error": "Doit contenir des lettres, des chiffres et des majuscules. exemple123@domaine.domaine",
    "MDP_Oublie_Envoyer_Demande-Reinitialisation": "Envoyer la demande de réinitialisation",
    "MDP_Oublie_Logique": "La logique de réinitialisation du mot de passe n'est pas encore implémentée.",

    "nonTrouve_Titre" : "404",
    "nonTrouve_Aide_P1" : "Si vous avez pensé qu'ici vou allez retrouver les réponses aux devinettes, je l'ai prévu. C'EST VIDE. HA-HA-HA!",
    "nonTrouve_H1": "Page non trouvée",
    "nonTrouve_P1": "Vous avez atteint une page inexistante.",
    "nonTrouve_P2": "Répondez à la devinette pour accéder à la page d'Accueil:",
    "nonTrouve_Input": "Essayez de répondre incorrectement.",
    "nonTrouve_Bouton": "Soumettre",
    "nonTrouve_Mauvaise_Reponse": "Mauvaise réponse. Réessayez.",

    "devinette_1": "Quel framework JavaScript est utilisé dans cette application?",
    "devinette_2": "Quel est le langage de programmation principal d'Angular?",
    "devinette_3": "Qui est le meilleur professeur de programmation Web?",

    "documentation_Aide_Titre": "Documentation",
    "documentation_Aide_P1": "Bienvenue dans documentation complète. Si vous avez besoin d'aide pour comprendre nos compétences et expertises, vous êtes au bon endroit. Explorez nos connaissances techniques ci-dessous pour mieux appréhender ce que nous pouvons vous offrir.",
    "documentation_Aide_P2": "HTML : Découvrez comment nous utilisons HTML pour créer la structure de sites web, garantissant une navigation fluide et une présentation logique.",
    "documentation_Aide_P3": "CSS : Apprenez comment CSS ajoute du style à votre site web, en définissant les couleurs, les polices et d'autres propriétés pour une expérience visuelle attrayante.",
    "documentation_Aide_P4": "JavaScript : Explorez comment JavaScript est utilisé pour rendre votre site interactif avec des fonctionnalités dynamiques.",
    "documentation_Aide_P5": "Angular : Découvrez comment nous utilisons Angular, un framework JavaScript, pour créer des applications web complexes et réactives.",
    "documentation_Aide_P6": "Bootstrap : Apprenez comment nous utilisons Bootstrap, un framework CSS, pour concevoir des sites web réactifs et esthétiques plus rapidement et efficacement.",
    "documentation_Aide_P7": "Java : Apprenez comment nous utilisons Java pour coder le backend de votre application, gérant les opérations essentielles en coulisses.",
    "documentation_Aide_P8": "Spring Framework : Explorez comment le Spring Framework simplifie le développement d'applications d'entreprise, y compris la gestion de la sécurité et des transactions.",
    "documentation_Aide_P9": "Base de données SQL : Découvrez comment nous utilisons SQL pour stocker et gérer efficacement les données de votre application.",

    "HTML": "Hypertext Markup Language",
    "HTML_Description": "C'est le pilier fondateur de la création de sites web. Ce langage de balisage structuré permet de définir la composition d'une page web, en organisant son contenu en titres, paragraphes, images, liens et autres éléments.",
    "HTML_Usage": "En utilisant HTML, nous construisons la structure de votre site de manière à ce qu'elle soit logique et bien formatée, garantissant une expérience de navigation fluide et agréable.",

    "CSS": "Cascade Style Sheet",
    "CSS_Description": "C'est l'outil de stylisation qui confère un aspect visuel à votre site web.",
    "CSS_Usage": "En combinant HTML avec CSS, je définis les couleurs, les polices, les marges, les espacements et d'autres propriétés de style pour rendre votre site web attrayant et professionnel.",

    "JavaScript": "JavaScript",
    "JavaScript_Description": "C'est un langage de programmation essentiel pour l'interactivité de votre site web.",
    "JavaScript_Usage": "Je l'utilise pour ajouter des fonctionnalités dynamiques, améliorant l'engagement des visiteurs et offrant une expérience utilisateur interactive.",

    "Angular": "Angular",
    "Angular_Description": "C'est un framework JavaScript développé par Google, conçu pour la création d'applications web complexes.",
    "Angular_Usage": "J'utilise Angular pour construire des applications modulaires et bien structurées, garantissant une expérience utilisateur fluide et réactive.",

    "Bootstrap": "Bootstrap",
    "Bootstrap_Description": "C'est un framework CSS open-source qui facilite la conception de sites web réactifs et esthétiques.",
    "Bootstrap_Usage": "J'utilise Bootstrap pour accélérer la création de mises en page et d'interfaces utilisateur attrayantes, en utilisant une collection de composants pré-conçus.",

    "Java": "Java",
    "Java_Description": "C'est un langage de programmation polyvalent utilisé dans divers domaines, y compris le développement d'applications de bureau, d'applications mobiles Android et d'applications d'entreprise.",
    "Java_Usage": "En Java, je code le backend de votre application, gérant les données, l'authentification et d'autres fonctionnalités essentielles.",

    "Spring": "Spring Framework",
    "Spring_Description": "C'est un framework Java réputé pour le développement d'applications d'entreprise, offrant une architecture prête à l'emploi pour simplifier le développement d'applications robustes.",
    "Spring_Usage": "Grâce à Spring, j'accélérè la création de vos applications d'entreprise tout en garantissant leur qualité et leur maintenance aisée.",

    "SQL": "Structured Query Language",
    "SQL_Description": "C'est un système de gestion de bases de données relationnelles, stockant de manière structurée des informations dans des tables interconnectées.",
    "SQL_Usage": "En utilisant SQL, je mets en place une base de données qui stocke et gère efficacement les données de votre application.",

    "contacter_H2": "Contactez-nous",
    "contacter_Nom": "Nom",
    "contacter_Prenom": "Prénom",
    "contacter_Courriel": "Courriel",
    "contacter_Message": "Message",
    "contacter_Envoyer": "Envoyer",
    "contacter_Envoyee" : "Message a été envoyé avec succès!",
    "contacter_Messages_Envoyes": "Afficher messages envoyés",

    "contacter_Aide_Titre": "Contactez-nous",
    "contacter_Aide_P1" : "Pour nous contacter, veuillez remplir le formulaire ci-dessous.",
    "contacter_Aide_P2" : "Nous sommes là pour vous aider à répondre à toutes vos questions et préoccupations.",
    "contacter_Aide_P3" : "Assurez-vous de remplir tous les champs requis pour que nous puissions vous répondre plus rapidement.",
    "contacter_Aide_P4" : "Veuillez fournir des informations valides pour que nous puissions vous joindre si nécessaire.",
    "contacter_Aide_P5" : "Votre message ne doit pas dépasser 250 caractères.",
    "contacter_Aide_P6" : "Cliquez sur le bouton 'Envoyer' lorsque vous avez terminé de remplir le formulaire.",
    "contacter_Aide_P7" : "Le button Afficher messages envoyés peut afficher vos messages déjà envoyés au propriétaire du site WEB",

    "contacter_Nom_Error_Message": "Doit contenir des lettres miniscules et des majuscules.",
    "contacter_Prenom_Error_Message": "Doit contenir des lettres, des chiffres et des majuscules.",
    "contacter_Courriel_Error_Message": "Doit contenir des lettres, des chiffres et des majuscules. exemple123@domaine.domaine.",
    "contacter_Limite_Error_Message": "Maximum de 250 caractères est atteint",

    "popup_H5": "Messages envoyés",
    "popup_Prenom": "Prénom",
    "popup_Nom": "Nom",
    "popup_Email": "Courriel",
    "popup_Telephone": "Téléphone",
    "popup_Message": "Message",

    "creer_reunion_H2": "Créer Réunion",
    "creer_reunion_Nom": "Nom",
    "creer_reunion_Prenom": "Prénom",
    "creer_reunion_Courriel": "Courriel",
    "creer_reunion_Description": "Description",
    "creer_reunion_ID_Reunion": "ID Réunion",
    "creer_reunion_Creer": "Créer Réunion",
    "creer_reunion_Reunion_Cree": "Réunion a été créée avec succès!",
    "dateDebut": "Date de début",
    "dateFin": "Date de fin",

    "creer_reunion_Aide_Titre" : "Créer Réunion",
    "creer_reunion_Aide_P1": "Bienvenue sur la page Créer Réunion. Cette page vous permet de créer une nouvelle réunion en fournissant les informations requises. Pour vous aider à remplir le formulaire de manière correcte, j,ai préparé des instructions détaillées ci-dessous.",
    "creer_reunion_Aide_P2": "1. Nom et Prénom : Veuillez saisir votre nom et prénom dans les champs appropriés. Assurez-vous que ces informations sont correctes, car elles sont importantes pour l'identification.",
    "creer_reunion_Aide_P3": "2. Courriel : Saisissez votre adresse électronique dans ce champ. Cela nous permettra de vous contacter et de vous envoyer des informations importantes concernant votre réunion.",
    "creer_reunion_Aide_P4": "3. Identifiant de Réunion : Vous devez fournir un identifiant unique pour votre réunion. Assurez-vous qu'il contient exactement 8 caractères.",
    "creer_reunion_Aide_P5": "4. Vous devez choisir les dates du début et de la fin de votre réunion.",
    "creer_reunion_Aide_P6": "5. Description : Ajoutez une description de votre réunion. Vous avez une limite de 250 caractères pour décrire votre réunion en quelques mots.",
    "creer_reunion_Aide_P7": "Une fois que vous avez rempli correctement le formulaire, le bouton 'Créer' sera activé, et vous pourrez créer votre réunion.",

    "creer_reunion_Nom_Error_Message": "Doit contenir des lettres miniscules et des majuscules.",
    "creer_reunion_Prenom_Error_Message": "Doit contenir des lettres, des chiffres et des majuscules.",
    "creer_reunion_Courriel_Error_Message": "Doit contenir des lettres, des chiffres et des majuscules. exemple123@domaine.domaine",
    "creer_reunion_ID_Error_Message": "Doit comporter maximum 8 caractères, lettres et chiffres",
    "creer_reunion_Limite_Error_Message": "Maximum de 250 caractères est atteint",
    "creer_reunion_ID_Existe_Error_Message": "ID existe déjà.",

    "voir_reunion_H2": "Consulter Réunion",
    "voir_reunion_Nom": "Nom",
    "voir_reunion_Prenom": "Prénom",
    "voir_reunion_ID_Reunion": "ID Réunion",
    "voir_reunion_Consulter": "Consulter Réunion",
    "voir_reunion_Date_Debut": "Date du début",
    "voir_reunion_Date_Fin": "Date de la fin",
    "voir_reunion_Courriel": "Courriel",
    "voir_reunion_Description": "Description",
    "voir_reunion_Participant": "Participant",
    "voir_reunion_Disponnible": "Disponibilité",
    "voir_reunion_Back": "Retour",
    "voir_reunion_Rejoindre": "Rejoindre",
    "voir_reunion_Ajouter" : "Ajouter ma disponibilité",
    "voir_reunion_Disponnible_placeholder" : "Disponnibilités de dd-mm-yyyy à dd-mm-yyyy",
    "voir_reunion_Deja_Participant" : "Vous participez déjà à la réunion",
    "participation_changement": "Vous participez maintenant à la réunion",

    "voir_reunion_Aide_Titre": "Consulter Réunion",
    "voir_reunion_Aide_P1": "La page de consultation de réunion vous permet de voir une réunion spécifique. Pour ce faire, suivez les étapes ci-dessous :",
    "voir_reunion_Aide_P2": "1. Remplissez les champs requis pour la recherche de réunion. Vous devez fournir votre nom, votre prénom et l'ID de la réunion.",
    "voir_reunion_Aide_P3": "2. Assurez-vous que les informations saisies sont correctes, car elles sont essentielles pour la recherche.",
    "voir_reunion_Aide_P4": "3. Une fois que vous avez rempli tous les champs requis, le bouton 'Consulter Réunion' deviendra disponible.",
    "voir_reunion_Aide_P5": "4. Cliquez sur le bouton 'Consulter Réunion' pour lancer la recherche.",
    "voir_reunion_Aide_P6": "5. Si les informations sont correctes et qu'une correspondance est trouvée, les détails de la réunion s'afficheront à l'écran.",
    "voir_reunion_Aide_P7": "6. Si aucune réunion n'est trouvée ou si les informations sont incorrectes, vous allez voir une tableau vide. Dans ce cas, vérifiez l'ID de la réunion et essayez à nouveau.",

    "voir_reunion_Nom_Error_Message": "Doit contenir des lettres miniscules et des majuscules.",
    "voir_reunion_Prenom_Error_Message": "Doit contenir des lettres, des chiffres et des majuscules.",
    "voir_reunion_ID_Error_Message": "Doit comporter maximum 8 caractères, lettres et chiffres",

    "reunions_Aide_Titre": "Tableau des réunions",
    "reunions_Aide_P1": "Bienvenue dans la page des réunions. Cette page vous permet de gérer les réunions créées. Vous trouverez ci-dessous des informations sur son fonctionnement :",
    "reunions_Aide_P2": "Les réunions sont affichées dans un tableau. Chaque ligne représente une réunion avec des détails tels que le nom, le prénom, le courriel, l'identificateur, la date et la description.",
    "reunions_Aide_P3": "Pour supprimer une réunion, cliquez sur le bouton de suppression (icône de corbeille) correspondant à la réunion que vous souhaitez supprimer. Une confirmation vous sera demandée avant la suppression.",
    "reunions_Aide_P4": "Vous allez voir les modifications instantannement si vous cliquez sur la button de suppression et confirmez votre choix.",

    "confirmation_Dialog_Title": "Confirmation de suppression",
    "confirmation_Dialog_Message": "Êtes-vous sûr de vouloir supprimer cette réunion? Attention cette action est irréversible et permanente!",
    "confirmation_Dialog_Supprimer": "Supprimer",
    "confirmation_Dialog_Annuler": "Annuler",
    "confirmation_suppression": "Êtes-vous sûr de vouloir supprimer cette réunion? Attention cette action est irréversible et permanente!",

    "tableau_position": "№",
    "tableau_courriel": "Courriel",
    "tableau_identificateur": "ID",
    "tableau_date": "Date",
    "tableau_description": "Description",
    "tableau_participants": "Participants (Disponibilitées)",
    "tableau_nom": "Nom du créateur",
    "tableau_prenom": "Prénom du créateur",
    "tableau_date1": "Date du début",
    "tableau_date2": "Date de la fin",
    "tableau_action": "Action",

    "date_manager": "Gérer les dates",
    "date_modifier": "Modifier une date",
    "date_debut": "Date du debut",
    "date_fin": "Date de la fin"

}
