{
    "non_connecte_H2": "Вы не вошли в систему",
    "non_connecte_message": "Вы должны войти в систему, чтобы получить доступ к этой странице.",

    "main_H4": "СОЗДАЙТЕ СВОЙ САЙТ КАК ПРОФЕССИОНАЛ",
    "main_H1_part1": "Привет, я",
    "main_Span": "Вазген",
    "main_H1_part2": ", ВЕБ-разработчик",
    "main_P1": "Увлечён созданием исключительного онлайн-опыта. Моя цель — воплотить ваши цифровые идеи в жизнь, от концепции до завершения, используя современные технологии и передовые методы разработки",
    "main_P2": "Обладая глубокими знаниями в HTML, CSS, JavaScript и страстью к удобному для пользователя дизайну, я стремлюсь создавать веб-сайты, которые не только впечатляют визуально, но и работают плавно и интуитивно, обеспечивая исключительный пользовательский опыт",
    "main_P3": "Независимо от того, нужно ли вам присутствие вашего бизнеса в Интернете, привлекательный интернет-магазин или индивидуальное веб-приложение, я здесь, чтобы воплотить ваше видение в цифровую реальность. Изучите мое портфолио, чтобы ознакомиться с некоторыми из моих недавних работ и не стесняйтесь обращаться ко мне, чтобы обсудить, как я могу помочь вам достичь ваших онлайн-целей.",
    "main_P4": "Изучите сайт, чтобы узнать больше о моем опыте и навыках, и не стесняйтесь обратиться ко мне, если у вас есть какие-либо вопросы или вы хотите поработать над интересным проектом. Вместе мы сможем создать что-то исключительное. Добро пожаловать в мое портфолио!",
    "main_H2": "Мои основы",
    "main_H4_part1": "Обязательство",
    "main_P_part1": "Моя полная отдача каждому проекту является краеугольным камнем моего подхода.",
    "main_H4_part2": "Творчество",
    "main_P_part2": "Инновации — мой источник вдохновения, а творчество выделяет меня среди других.",
    "main_H4_part3": "Техническая экспертиза",
    "main_P_part3": "Мое владение веб-технологиями обеспечивает производительность и надежность.",
    "main_H4_part4": "Сотрудничество",
    "main_P_part4": "Я ценю тесное сотрудничество со своими клиентами для достижения исключительных результатов.",
    "main_H4_part5": "Качество",
    "main_P_part5": "Моя приверженность к совершенству видна в каждом аспекте моей работы.",
    "main_H4_part6": "Отзывчивость",
    "main_P_part6": "Моя постоянная доступность гарантирует быстрое реагирование на ваши потребности",

    "main_Aide_Titre": "Главная",
    "main_Aide_P1": "Главная страница — это отправная точка вашего взаимодействия с нашим веб-сайтом.",
    "main_Aide_P2": "Оно предоставляет обзор функций и информацию, доступную здесь.",
    "main_Aide_P3": "Вот что вы можете здесь сделать:",
    "main_Aide_P4": "Домой: вернитесь на эту страницу в любое время, нажав Домой.",
    "main_Aide_P5": "Документация: подробную информацию о нашем сервисе можно найти в нашей документации.",
    "main_Aide_P6": "Контактная информация: по любым вопросам или помощи нажмите Связь, чтобы оставить нам сообщение.",
    "main_Aide_P7": "Создать Встречу: если вы хотите организовать встречу, используйте Создать Встречу, чтобы начать.",
    "main_Aide_P8": "Просмотр Встрече: Если вы хотите просмотреть/присоединиться ко встречи, используйте функцию Просмотр встреч, чтобы начать.",
    "main_Aide_P9": "Встречи: Если вы хотите просмотреть созданные встречи, используйте функцию Встречи.",
    "main_Aide_P10": "Вход: Если вы уже являетесь участником, войдите в систему, нажав Войти. В противном случае создайте учетную запись.",
    "main_Aide_P11": "Мы надеемся, что вам понравится посещение нашей домашней страницы и вы найдете необходимую информацию.",
    "main_Aide_P12": "Не стесняйтесь изучать и использовать предлагаемые функции, чтобы получить максимальную отдачу от нашего веб-сайта.",

    "footer_H5": "© 2023 | Вазген Маркарян.",
    "footer_Button1": "Французский (FR)",
    "footer_Button2": "Английский (EN)",
    "footer_Button3": "Русский (RU)",

    "navbar_Accueil": "Главная",
    "navbar_Documentation": "Документация",
    "navbar_Contacter": "Связь",
    "navbar_Creer_Reunion": "Создать Встречю",
    "navbar_Consulter_Reunion": "Просмотреть Встречу",
    "navbar_Reunions": "Встречи",
    "navbar_Connexion": "Войти",
    "navbar_Aide": "Помощь",
    "deconnexion": "Выход",

    "connexion_H2": "Вход",
    "connexion_Pseudonime": "Псевдоним",
    "connexion_MDP": "Пароль",
    "connexion_MDP_Oublie": "Забыли пароль?",
    "connexion_Inscrivez_Vous": "Зарегестрироваться",
    "connexion_Se_Connecter": "Войти",
    "connexion_Pseudonime_Error": "Должно содержать строчные и заглавные буквы и цифры.",
    "connexion_Password_Error": "Должен содержать не менее 8 символов, заглавную букву и цифру.",
    "connexion_Authentification_Erreur": "Ошибка аутентификации. Попробуйте еще раз.",
    "connexion_Connexion_Erreur": "Неверный псевдоним или пароль или пользователь не существует.",

    "inscription_H2": "Регистрация",
    "inscription_Pseudonime": "Псевдоним",
    "inscription_MDP": "Пароль",
    "inscription_MDP_Confirmation": "Подтверждение пароля",
    "inscription_Deja_Inscrit": "Уже зарегистрированы?",
    "inscription_Inscrire": "Зарегестрироваться",
    "inscription_Pseudonime_Error": "Должно содержать строчные и заглавные буквы и цифры",
    "inscription_Password_Error": "Должен содержать не менее 8 символов, заглавную букву и цифру.",
    "inscription_Confirmation_Error": "Пароли не совпадают.",
    "utilisateur_existant": "Этот псевдоним уже существует. Выберите другой.",

    "MDP_Oublie_H2": "Забыли пароль",
    "MDP_Oublie_Pseudonime": "Псевдоним",
    "MDP_Oublie_Courriel": "Электронная почта",
    "MDP_Oublie_Retour_Connexion": "Подключиться",
    "MDP_Oublie_Pseudonime_Error": "Должно содержать строчные и заглавные буквы и цифры.",
    "MDP_Oublie_Courriel_Invalide_Error": "Должно содержать строчные и заглавные буквы и цифры. primer123@domain.domain",
    "MDP_Oublie_Envoyer_Demande-Reinitialisation": "Отправить запрос на сброс",
    "MDP_Oublie_Logique": "Логика сброса пароля еще не реализована.",

    "nonTrouve_Titre" : "404",
    "nonTrouve_Aide_P1" : "Если вы думали, что здесь найдете ответы на загадки, у меня для вас новости. ЗДЕСЬ НИЧЕГО НЕТ. XA-XA-XA!",
    "nonTrouve_H1": "Страница не найдена",
    "nonTrouve_P1": "Вы попали на несуществующую страницу.",
    "nonTrouve_P2": "Ответьте на загадку, чтобы получить доступ к домашней странице:",
    "nonTrouve_Input": "Ваш ответ тут",
    "nonTrouve_Button": "Проверить",
    "nonTrouve_Mauvaise_Reponse": "Неверный ответ. Попробуйте еще раз.",

    "devinette_1": "Какая платформа JavaScript используется в этом приложении?",
    "devinette_2": "Какой основной язык программирования Angular?",
    "devinette_3": "Кто лучший преподаватель WEB-программирования?",

    "documentation_Aide_Titre": "Документация",
    "documentation_Aide_P1": "Добро пожаловать в полноценную документацию. Если вам нужна помощь в понимании наших навыков и экспертизы, вы находитесь в правильном месте. Изучите наши технические знания ниже, чтобы лучше понять, что мы можем вам предложить.",
    "documentation_Aide_P2": "HTML: Узнайте, как мы используем HTML для создания структуры веб-сайтов, обеспечивая плавную навигацию и логичное представление.",
    "documentation_Aide_P3": "CSS: Узнайте, как CSS добавляет стиль вашему веб-сайту, задавая цвета, шрифты и другие свойства для привлекательного визуального опыта.",
    "documentation_Aide_P4": "JavaScript: Изучите, как JavaScript используется для придания интерактивности вашему веб-сайту с динамическими функциями.",
    "documentation_Aide_P5": "Angular: Познакомьтесь с тем, как мы используем Angular, фреймворк на языке JavaScript, для создания сложных и отзывчивых веб-приложений.",
    "documentation_Aide_P6": "Bootstrap: Узнайте, как мы используем Bootstrap, фреймворк на языке CSS, для создания отзывчивых и эстетичных веб-сайтов более быстро и эффективно.",
    "documentation_Aide_P7": "Java: Узнайте, как мы используем Java для написания бэкенда вашего приложения, обрабатывая важные операции в фоновом режиме.",
    "documentation_Aide_P8": "Spring Framework: Изучите, как Spring Framework упрощает разработку предприятий, включая управление безопасностью и транзакциями.",
    "documentation_Aide_P9": "SQL-базы данных: Узнайте, как мы используем SQL для эффективного хранения и управления данными вашего приложения.",

    "HTML": "Язык гипертекстовой разметки (HTML)",
    "HTML_Description": "HTML - это основа создания веб-сайтов. Этот язык структурированной разметки позволяет мне определить структуру веб-страницы, организуя ее содержимое в заголовки, абзацы, изображения, ссылки и другие элементы.",
    "HTML_Usage": "Используя HTML, я создаю структуру вашего сайта так, чтобы она была логичной и хорошо отформатированной, обеспечивая плавное и приятное взаимодействие для пользователей.",

    "CSS": "Каскадные таблицы стилей (CSS)",
    "CSS_Description": "CSS - это инструмент стилизации, который обеспечивает визуальное оформление вашего веб-сайта.",
    "CSS_Usage": "Совмещая HTML с CSS, я определяю цвета, шрифты, отступы, интервалы и другие стилевые свойства, чтобы сделать ваш веб-сайт привлекательным и профессиональным.",

    "JavaScript": "JavaScript",
    "JavaScript_Description": "JavaScript - это важный язык программирования для интерактивности вашего веб-сайта.",
    "JavaScript_Usage": "Я использую его для добавления динамических функций, улучшая взаимодействие посетителей и предоставляя интерактивный пользовательский опыт.",

    "Angular": "Angular",
    "Angular_Description": "Angular - это фреймворк JavaScript, разработанный Google, предназначенный для создания сложных веб-приложений.",
    "Angular_Usage": "Я использую Angular для создания модульных и хорошо структурированных приложений, обеспечивая плавное и отзывчивое взаимодействие пользователя.",

    "Bootstrap": "Bootstrap",
    "Bootstrap_Description": "Bootstrap - это открытый CSS-фреймворк, который значительно упрощает создание отзывчивых и красочных веб-сайтов.",
    "Bootstrap_Usage": "Я использую Bootstrap, чтобы ускорить создание привлекательных макетов и интерфейсов, используя набор предварительно разработанных компонентов.",

    "Java": "Java",
    "Java_Description": "Java - универсальный язык программирования, используемый в различных областях, включая разработку настольных приложений, мобильных приложений для Android и корпоративных приложений.",
    "Java_Usage": "На Java я могу создать серверную часть вашего приложения, управляя данными, аутентификацией и другими важными функциями.",

    "Spring": "Spring Framework",
    "Spring_Description": "Spring Framework - это известный фреймворк Java для разработки корпоративных приложений, предоставляющий готовую архитектуру для упрощения создания надежных приложений.",
    "Spring_Usage": "С помощью Spring я ускоряю создание ваших корпоративных приложений, обеспечивая их качество и упрощая их обслуживание.",

    "SQL": "Язык структурированных запросов (SQL)",
    "SQL_Description": "SQL - это система управления реляционными базами данных, которая хранит информацию в структурированных таблицах.",
    "SQL_Usage": "Используя SQL, я создаю базу данных, которая эффективно хранит и управляет данными вашего приложения.",

    "contacter_H2": "Свяжитесь с нами",
    "contacter_Nom": "Фамилия",
    "contacter_Prenom": "Имя",
    "contacter_Courriel": "Электронная почта",
    "contacter_Message": "Сообщение",
    "contacter_Envoyer": "Отправить",
    "contacter_Envoyee": "Ваше сообщение было отправлено!",
    "contacter_Messages_Envoyes": "Показать отправленные сообщения",

    "contacter_Aide_Titre": "Свяжитесь с нами",
    "contacter_Aide_P1" : "Чтобы связаться с нами, заполните форму ниже.",
    "contacter_Aide_P2" : "Мы здесь, чтобы помочь вам ответить на все ваши вопросы и заботы.",
    "contacter_Aide_P3" : "Убедитесь, что вы заполнили все обязательные поля, чтобы мы могли ответить вам быстрее.",
    "contacter_Aide_P4" : "Пожалуйста, предоставьте действительную информацию, чтобы мы могли связаться с вами, если это необходимо.",
    "contacter_Aide_P5" : "Ваше сообщение не должно превышать 250 символов.",
    "contacter_Aide_P6" : "Нажмите кнопку 'Отправить', когда вы закончите заполнять форму.",
    "contacter_Aide_P7" : "Кнопка «Показать отправленные сообщения» может отображать ваши сообщения, уже отправленные владельцу веб-сайта.",

    "contacter_Nom_Error_Message": "Должно содержать строчные и прописные буквы.",
    "contacter_Prenom_Error_Message": "Должно содержать буквы, цифры и прописные буквы.",
    "contacter_Courriel_Error_Message": "Должно содержать буквы, цифры и прописные буквы. example123@почта.почта.",
    "contacter_Limite_Error_Message": "Достигнут максимум в 250 символов.",

    "popup_H5": "Отправленные сообщения",
    "popup_Prenom": "Имя",
    "popup_Nom": "Фамилия",
    "popup_Email": "Электронная почта",
    "popup_Telephone": "Телефон",
    "popup_Message": "Сообщение",

    "creer_reunion_H2": "Создать Встречю",
    "creer_reunion_Nom": "Фамилия",
    "creer_reunion_Prenom": "Имя",
    "creer_reunion_Courriel": "Электронная почта",
    "creer_reunion_Description": "Описание",
    "creer_reunion_ID_Reunion": "Идентификатор Встречи",
    "creer_reunion_Creer": "Создать Встречу",
    "creer_reunion_Reunion_Cree": "Встреча создана!",
    "dateDebut": "Дата начала",
    "dateFin": "Дата окончания",

    "creer_reunion_Aide_Titre": "Создать Встречю",
    "creer_reunion_Aide_P1": "Добро пожаловать на страницу создания Встреч. Эта страница позволяет вам создавать новую встречу, предоставляя необходимую информацию. Чтобы помочь вам правильно заполнить форму, я подготовил подробные инструкции ниже.",
    "creer_reunion_Aide_P2": "1. Фамилия и Имя: Пожалуйста, введите вашу фамилию и имя в соответствующие поля. Обязательно убедитесь, что эта информация верна, так как она важна для идентификации.",
    "creer_reunion_Aide_P3": "2. Электронная почта: Введите свой адрес электронной почты в это поле. Это позволит нам связаться с вами и отправить важную информацию о вашей встрече.",
    "creer_reunion_Aide_P4": "3. Идентификатор Встречи: Вы должны предоставить уникальный идентификатор для вашего реюньона. Убедитесь, что он содержит ровно 8 символов.",
    "creer_reunion_Aide_P5": "4. Вы должны выбрать даты начала и окончания вашей встречи.",
    "creer_reunion_Aide_P6": "5. Описание: Добавьте описание вашей встречи. У вас есть ограничение в 250 символов, чтобы описать детали в нескольких словах.",
    "creer_reunion_Aide_P7": "После правильного заполнения формы кнопка 'Создать' станет активной, и вы сможете создать свою встречу.",

    "creer_reunion_Nom_Error_Message": "Должно содержать строчные и заглавные буквы.",
    "creer_reunion_Prenom_Error_Message": "Должно содержать буквы, цифры и заглавные буквы.",
    "creer_reunion_Courriel_Error_Message": "Должно содержать буквы, цифры и заглавные буквы. example123@domain.domain",
    "creer_reunion_ID_Error_Message": "Должен содержать не более 8 символов, букв и цифр.",
    "creer_reunion_Limite_Error_Message": "Достигнут максимум из 250 символов.",
    "creer_reunion_ID_Existe_Error_Message": "ID уже существует.",

    "voir_reunion_H2": "Просмотреть встречу",
    "voir_reunion_Nom": "Фамилия",
    "voir_reunion_Prenom": "Имя",
    "voir_reunion_ID_Reunion": "ID встречи",
    "voir_reunion_Consulter": "Просмотреть встречу",
    "voir_reunion_Date_Debut": "Дата начала",
    "voir_reunion_Date_Fin": "Дата окончания",
    "voir_reunion_Courriel": "Электронная почта",
    "voir_reunion_Description": "Описание",
    "voir_reunion_Participant": "Участник",
    "voir_reunion_Disponnible": "Доступность",
    "voir_reunion_Back": "Назад",
    "voir_reunion_Rejoindre": "Присоединиться",
    "voir_reunion_Ajouter" : "Добавить мою доступность",
    "voir_reunion_Disponnible_placeholder" : "Доступность с dd-mm-yyyy по dd-mm-yyyy",
    "voir_reunion_Deja_Participant" : "Вы уже член встречи",
    "participation_changement": "Теперь вы член встречи",

    "voir_reunion_Aide_Titre": "Просмотр Встречи",
    "voir_reunion_Aide_P1": "Страница просмотра встречи позволяет вам просматривать конкретный реюньон. Для этого выполните следующие шаги:",
    "voir_reunion_Aide_P2": "1. Заполните обязательные поля для поиска встречи. Вы должны предоставить ваше имя и фамилию и идентификатор встречи.",
    "voir_reunion_Aide_P3": "2. Убедитесь, что введенная вами информация верна, так как она важна для поиска.",
    "voir_reunion_Aide_P4": "3. Как только вы заполните все обязательные поля, кнопка 'Просмотр Встречи' станет доступной.",
    "voir_reunion_Aide_P5": "4. Нажмите на кнопку 'Просмотр Встречи', чтобы начать поиск.",
    "voir_reunion_Aide_P6": "5. Если информация верна, и найдено совпадение, детали встречи будут отображены на экране.",
    "voir_reunion_Aide_P7": "6. Если встреча не найдена или информация неверна, вы увидите пустую таблицу. В данном случае проверьте правильность Идентификатора встречи и повторите попытку.",

    "voir_reunion_Nom_Error_Message": "Должно содержать строчные и прописные буквы.",
    "voir_reunion_Prenom_Error_Message": "Должно содержать буквы, цифры и прописные буквы.",
    "voir_reunion_ID_Error_Message": "Должно содержать не более 8 символов, буквы и цифры.",

    "reunions_Aide_Titre": "Таблица встреч",
    "reunions_Aide_P1": "Добро пожаловать на страницу встреч. Эта страница позволяет управлять созданными встречами. Вот информация о том, как это работает:",
    "reunions_Aide_P2": "Встречи отображаются в таблице. Каждая строка представляет собой встречу с подробностями, такими как имя, фамилия, электронная почта, идентификатор, дата и описание.",
    "reunions_Aide_P3": "Для удаления встречи щелкните кнопку удаления (иконка корзины), возле соответствующей встречи, которое вы хотите удалить. Перед удалением будет запрошено подтверждение.",
    "reunions_Aide_P4": "Вы мгновенно увидите изменения, если щелкнете кнопку удаления и подтвердите свой выбор.",

    "confirmation_Dialog_Title": "Подтверждение удаления",
    "confirmation_Dialog_Message": "Вы уверены, что хотите удалить эту встречу? Осторожно, это действие необратимо!",
    "confirmation_Dialog_Supprimer": "Удалить",
    "confirmation_Dialog_Annuler": "Отмена",
    "confirmation_suppression": "Вы уверены, что хотите удалить эту встречу? Обратите внимание, что это действие нельзя отменить и оно является постоянным!",

    "tableau_position": "№",
    "tableau_courriel": "Электронная почта",
    "tableau_identificateur": "ID",
    "tableau_date": "Дата",
    "tableau_description": "Описание",
    "tableau_participants": "Участники (Доступности)",
    "tableau_nom": "Фамилия создателя",
    "tableau_prenom": "Имя создателя",
    "tableau_date1": "Дата начала",
    "tableau_date2": "Дата окончания",
    "tableau_action": "Действие",

    "date_manager": "Управление датами",
    "date_modifier": "Изменить дату",
    "date_debut": "Дата начала",
    "date_fin": "Дата окончания"

}
